# CouplerLinkTwoBars Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarCoupler..::..CouplerLinkTwoBars Method
RebarCoupler Class See Also
---
returns true if the coupler sits on two rebar and false otherwise
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public bool CouplerLinkTwoBars()
```

Visual Basic
---
```text
Public Function CouplerLinkTwoBars As Boolean
```

Visual C++
---
```text
public:
bool CouplerLinkTwoBars()
```

# See Also
RebarCoupler Class
Autodesk.Revit.DB.Structure Namespace